
build/output.elf:     file format elf32-littlearm


Disassembly of section .text:

00008000 <_start>:
    8000:	e92d0007 	push	{r0, r1, r2}
    8004:	e3a00b01 	mov	r0, #1024	; 0x400
    8008:	e3a01c03 	mov	r1, #768	; 0x300
    800c:	e3a02010 	mov	r2, #16
    8010:	eb00002c 	bl	80c8 <InitialiseFrameBuffer>
    8014:	e8bd0007 	pop	{r0, r1, r2}
    8018:	eb000000 	bl	8020 <main>

0000801c <_infinite_loop$>:
    801c:	eafffffe 	b	801c <_infinite_loop$>

00008020 <main>:
    8020:	e1a04002 	mov	r4, r2
    8024:	e92d4008 	push	{r3, lr}
    8028:	eb00004e 	bl	8168 <habilitar_GPIO_ACT_LED_output>
    802c:	e1a00004 	mov	r0, r4
    8030:	eb0003db 	bl	8fa4 <bgInit>
    8034:	eb000056 	bl	8194 <enciende_ACT_LED>
    8038:	eb0001ab 	bl	86ec <bgRefresh>
    803c:	e59f0014 	ldr	r0, [pc, #20]	; 8058 <main+0x38>
    8040:	eb00005b 	bl	81b4 <RPI_esperarMicroSeconds>
    8044:	eb00004d 	bl	8180 <apaga_ACT_LED>
    8048:	eb0001a7 	bl	86ec <bgRefresh>
    804c:	e59f0004 	ldr	r0, [pc, #4]	; 8058 <main+0x38>
    8050:	eb000057 	bl	81b4 <RPI_esperarMicroSeconds>
    8054:	eafffff6 	b	8034 <main+0x14>
    8058:	0007a120 	.word	0x0007a120

0000805c <MailboxWrite>:
    805c:	e310000f 	tst	r0, #15
    8060:	11a0f00e 	movne	pc, lr
    8064:	e351000f 	cmp	r1, #15
    8068:	81a0f00e 	movhi	pc, lr
    806c:	e1a02000 	mov	r2, r0
    8070:	e52de004 	push	{lr}		; (str lr, [sp, #-4]!)
    8074:	e59f00a8 	ldr	r0, [pc, #168]	; 8124 <InitialiseFrameBuffer+0x5c>

00008078 <wait1$>:

    <2fe>   DW_AT_name        : (indirect string, offset: 0x15f): source/rpi-gpio.c	
    <302>   DW_AT_comp_dir    : (indirect string, offset: 0x132): /home/robert/Desktop/rasp/chapuzas/template2	
    <306>   DW_AT_low_pc      : 0x8168	
    <30a>   DW_AT_high_pc     : 0x40	
    <30e>   DW_AT_stmt_list   : 0x1e0	
 <1><312>: Abbrev Number: 2 (DW_TAG_subprogram)
    <313>   DW_AT_external    : 1	
    <313>   DW_AT_name        : (indirect string, offset: 0x61): habilitar_GPIO_ACT_LED_output	
    <317>   DW_AT_decl_file   : 1	
    <318>   DW_AT_decl_line   : 5	
    <319>   DW_AT_low_pc      : 0x8168	
    <31d>   DW_AT_high_pc     : 0x18	
    <321>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <323>   DW_AT_GNU_all_call_sites: 1	
 <1><323>: Abbrev Number: 2 (DW_TAG_subprogram)
    <324>   DW_AT_external    : 1	
    <324>   DW_AT_name        : (indirect string, offset: 0x1f): apaga_ACT_LED	
    <328>   DW_AT_decl_file   : 1	
    <329>   DW_AT_decl_line   : 9	
    <32a>   DW_AT_low_pc      : 0x8180	
    <32e>   DW_AT_high_pc     : 0x14	
    <332>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <334>   DW_AT_GNU_all_call_sites: 1	
 <1><334>: Abbrev Number: 2 (DW_TAG_subprogram)
    <335>   DW_AT_external    : 1	
    <335>   DW_AT_name        : (indirect string, offset: 0xf8): enciende_ACT_LED	
    <339>   DW_AT_decl_file   : 1	
    <33a>   DW_AT_decl_line   : 14	
    <33b>   DW_AT_low_pc      : 0x8194	
    <33f>   DW_AT_high_pc     : 0x14	
    <343>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <345>   DW_AT_GNU_all_call_sites: 1	
 <1><345>: Abbrev Number: 3 (DW_TAG_variable)
    <346>   DW_AT_name        : (indirect string, offset: 0x171): gpio	
    <34a>   DW_AT_decl_file   : 1	
    <34b>   DW_AT_decl_line   : 3	
    <34c>   DW_AT_type        : <0x354>	
    <350>   DW_AT_const_value : 0x20200000	
 <1><354>: Abbrev Number: 4 (DW_TAG_const_type)
    <355>   DW_AT_type        : <0x359>	
 <1><359>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <35a>   DW_AT_byte_size   : 4	
    <35b>   DW_AT_type        : <0x35f>	
 <1><35f>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <360>   DW_AT_type        : <0x364>	
 <1><364>: Abbrev Number: 7 (DW_TAG_base_type)
    <365>   DW_AT_byte_size   : 4	
    <366>   DW_AT_encoding    : 7	(unsigned)
    <367>   DW_AT_name        : (indirect string, offset: 0x3c): unsigned int	
 <1><36b>: Abbrev Number: 0
  Compilation Unit @ offset 0x36c:
   Length:        0x149 (32-bit)
   Version:       4
   Abbrev Offset: 0x196
   Pointer Size:  4
 <0><377>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <378>   DW_AT_producer    : (indirect string, offset: 0x7f): GNU C 4.8.2 -mfpu=vfp -mfloat-abi=hard -march=armv6zk -mtune=arm1176jzf-s -g -O2	
    <37c>   DW_AT_language    : 1	(ANSI C)
    <37d>   DW_AT_name        : (indirect string, offset: 0x1f1): source/rpi-systimer.c	
    <381>   DW_AT_comp_dir    : (indirect string, offset: 0x132): /home/robert/Desktop/rasp/chapuzas/template2	
    <385>   DW_AT_low_pc      : 0x81a8	
    <389>   DW_AT_high_pc     : 0x3c	
    <38d>   DW_AT_stmt_list   : 0x224	
 <1><391>: Abbrev Number: 2 (DW_TAG_base_type)
    <392>   DW_AT_byte_size   : 1	
    <393>   DW_AT_encoding    : 6	(signed char)
    <394>   DW_AT_name        : (indirect string, offset: 0x55): signed char	
 <1><398>: Abbrev Number: 2 (DW_TAG_base_type)
    <399>   DW_AT_byte_size   : 1	
    <39a>   DW_AT_encoding    : 8	(unsigned char)
    <39b>   DW_AT_name        : (indirect string, offset: 0x53): unsigned char	
 <1><39f>: Abbrev Number: 2 (DW_TAG_base_type)
    <3a0>   DW_AT_byte_size   : 2	
    <3a1>   DW_AT_encoding    : 5	(signed)
    <3a2>   DW_AT_name        : (indirect string, offset: 0x121): short int	
 <1><3a6>: Abbrev Number: 2 (DW_TAG_base_type)
    <3a7>   DW_AT_byte_size   : 2	
    <3a8>   DW_AT_encoding    : 7	(unsigned)
    <3a9>   DW_AT_name        : (indirect string, offset: 0xdb): short unsigned int	
 <1><3ad>: Abbrev Number: 2 (DW_TAG_base_type)
    <3ae>   DW_AT_byte_size   : 4	
    <3af>   DW_AT_encoding    : 5	(signed)
    <3b0>   DW_AT_name        : (indirect string, offset: 0x5): long int	
 <1><3b4>: Abbrev Number: 3 (DW_TAG_typedef)
    <3b5>   DW_AT_name        : (indirect string, offset: 0xd0): __uint32_t	
    <3b9>   DW_AT_decl_file   : 2	
    <3ba>   DW_AT_decl_line   : 56	
    <3bb>   DW_AT_type        : <0x3bf>	
 <1><3bf>: Abbrev Number: 2 (DW_TAG_base_type)
    <3c0>   DW_AT_byte_size   : 4	
    <3c1>   DW_AT_encoding    : 7	(unsigned)
    <3c2>   DW_AT_name        : (indirect string, offset: 0x37): long unsigned int	
 <1><3c6>: Abbrev Number: 2 (DW_TAG_base_type)
    <3c7>   DW_AT_byte_size   : 8	
    <3c8>   DW_AT_encoding    : 5	(signed)
    <3c9>   DW_AT_name        : (indirect string, offset: 0x0): long long int	
 <1><3cd>: Abbrev Number: 2 (DW_TAG_base_type)
    <3ce>   DW_AT_byte_size   : 8	
    <3cf>   DW_AT_encoding    : 7	(unsigned)
    <3d0>   DW_AT_name        : (indirect string, offset: 0x32): long long unsigned int	
 <1><3d4>: Abbrev Number: 4 (DW_TAG_base_type)
    <3d5>   DW_AT_byte_size   : 4	
    <3d6>   DW_AT_encoding    : 5	(signed)
    <3d7>   DW_AT_name        : int	
 <1><3db>: Abbrev Number: 2 (DW_TAG_base_type)
    <3dc>   DW_AT_byte_size   : 4	
    <3dd>   DW_AT_encoding    : 7	(unsigned)
    <3de>   DW_AT_name        : (indirect string, offset: 0x3c): unsigned int	
 <1><3e2>: Abbrev Number: 3 (DW_TAG_typedef)
    <3e3>   DW_AT_name        : (indirect string, offset: 0xd2): uint32_t	
    <3e7>   DW_AT_decl_file   : 3	
    <3e8>   DW_AT_decl_line   : 66	
    <3e9>   DW_AT_type        : <0x3b4>	
 <1><3ed>: Abbrev Number: 5 (DW_TAG_structure_type)
    <3ee>   DW_AT_byte_size   : 28	
    <3ef>   DW_AT_decl_file   : 4	
    <3f0>   DW_AT_decl_line   : 10	
    <3f1>   DW_AT_sibling     : <0x44a>	
 <2><3f5>: Abbrev Number: 6 (DW_TAG_member)
    <3f6>   DW_AT_name        : (indirect string, offset: 0x1a5): control_status	
    <3fa>   DW_AT_decl_file   : 4	
    <3fb>   DW_AT_decl_line   : 11	
    <3fc>   DW_AT_type        : <0x44a>	
    <400>   DW_AT_data_member_location: 0	
 <2><401>: Abbrev Number: 6 (DW_TAG_member)
    <402>   DW_AT_name        : (indirect string, offset: 0x1b4): counter_lo	
    <406>   DW_AT_decl_file   : 4	
    <407>   DW_AT_decl_line   : 12	
    <408>   DW_AT_type        : <0x44a>	
    <40c>   DW_AT_data_member_location: 4	
 <2><40d>: Abbrev Number: 6 (DW_TAG_member)
    <40e>   DW_AT_name        : (indirect string, offset: 0x19a): counter_hi	
    <412>   DW_AT_decl_file   : 4	
    <413>   DW_AT_decl_line   : 13	
    <414>   DW_AT_type        : <0x44a>	
    <418>   DW_AT_data_member_location: 8	
 <2><419>: Abbrev Number: 6 (DW_TAG_member)
    <41a>   DW_AT_name        : (indirect string, offset: 0x176): compare0	
    <41e>   DW_AT_decl_file   : 4	
    <41f>   DW_AT_decl_line   : 14	
    <420>   DW_AT_type        : <0x44a>	
    <424>   DW_AT_data_member_location: 12	
 <2><425>: Abbrev Number: 6 (DW_TAG_member)
    <426>   DW_AT_name        : (indirect string, offset: 0x17f): compare1	
    <42a>   DW_AT_decl_file   : 4	
    <42b>   DW_AT_decl_line   : 15	
    <42c>   DW_AT_type        : <0x44a>	
    <430>   DW_AT_data_member_location: 16	
 <2><431>: Abbrev Number: 6 (DW_TAG_member)
    <432>   DW_AT_name        : (indirect string, offset: 0x188): compare2	
    <436>   DW_AT_decl_file   : 4	
    <437>   DW_AT_decl_line   : 16	
    <438>   DW_AT_type        : <0x44a>	
    <43c>   DW_AT_data_member_location: 20	
 <2><43d>: Abbrev Number: 6 (DW_TAG_member)
    <43e>   DW_AT_name        : (indirect string, offset: 0x191): compare3	
    <442>   DW_AT_decl_file   : 4	
    <443>   DW_AT_decl_line   : 17	
    <444>   DW_AT_type        : <0x44a>	
    <448>   DW_AT_data_member_location: 24	
 <2><449>: Abbrev Number: 0
 <1><44a>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <44b>   DW_AT_type        : <0x3e2>	
 <1><44f>: Abbrev Number: 3 (DW_TAG_typedef)
    <450>   DW_AT_name        : (indirect string, offset: 0x1d2): rpi_sys_timer_t	
    <454>   DW_AT_decl_file   : 4	
    <455>   DW_AT_decl_line   : 18	
    <456>   DW_AT_type        : <0x3ed>	
 <1><45a>: Abbrev Number: 8 (DW_TAG_subprogram)
    <45b>   DW_AT_external    : 1	
    <45b>   DW_AT_name        : (indirect string, offset: 0x1bf): RPI_GetSystemTimer	
    <45f>   DW_AT_decl_file   : 1	
    <460>   DW_AT_decl_line   : 5	
    <461>   DW_AT_prototyped  : 1	
    <461>   DW_AT_type        : <0x46f>	
    <465>   DW_AT_low_pc      : 0x81a8	
    <469>   DW_AT_high_pc     : 0xc	
    <46d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <46f>   DW_AT_GNU_all_call_sites: 1	
 <1><46f>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <470>   DW_AT_byte_size   : 4	
    <471>   DW_AT_type        : <0x44f>	
 <1><475>: Abbrev Number: 10 (DW_TAG_subprogram)
    <476>   DW_AT_external    : 1	
    <476>   DW_AT_name        : (indirect string, offset: 0x109): RPI_esperarMicroSeconds	
    <47a>   DW_AT_decl_file   : 1	
    <47b>   DW_AT_decl_line   : 10	
    <47c>   DW_AT_prototyped  : 1	
    <47c>   DW_AT_low_pc      : 0x81b4	
    <480>   DW_AT_high_pc     : 0x30	
    <484>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <486>   DW_AT_GNU_all_call_sites: 1	
    <486>   DW_AT_sibling     : <0x4a4>	
 <2><48a>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <48b>   DW_AT_name        : us	
    <48e>   DW_AT_decl_file   : 1	
    <48f>   DW_AT_decl_line   : 10	
    <490>   DW_AT_type        : <0x3e2>	
    <494>   DW_AT_location    : 1 byte block: 50 	(DW_OP_reg0 (r0))
 <2><496>: Abbrev Number: 12 (DW_TAG_variable)
    <497>   DW_AT_name        : ts	
    <49a>   DW_AT_decl_file   : 1	
    <49b>   DW_AT_decl_line   : 12	
    <49c>   DW_AT_type        : <0x44a>	
    <4a0>   DW_AT_location    : 2 byte block: 91 7c 	(DW_OP_fbreg: -4)
 <2><4a3>: Abbrev Number: 0
 <1><4a4>: Abbrev Number: 13 (DW_TAG_variable)
    <4a5>   DW_AT_name        : (indirect string, offset: 0x1e2): rpiSystemTimer	
    <4a9>   DW_AT_decl_file   : 1	
    <4aa>   DW_AT_decl_line   : 3	
    <4ab>   DW_AT_type        : <0x4b3>	
    <4af>   DW_AT_const_value : 0x20003000	
 <1><4b3>: Abbrev Number: 14 (DW_TAG_const_type)
    <4b4>   DW_AT_type        : <0x46f>	
 <1><4b8>: Abbrev Number: 0
  Compilation Unit @ offset 0x4b9:
   Length:        0x538 (32-bit)
   Version:       4
   Abbrev Offset: 0x261
   Pointer Size:  4
 <0><4c4>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <4c5>   DW_AT_producer    : (indirect string, offset: 0x7f): GNU C 4.8.2 -mfpu=vfp -mfloat-abi=hard -march=armv6zk -mtune=arm1176jzf-s -g -O2	
    <4c9>   DW_AT_language    : 1	(ANSI C)
    <4ca>   DW_AT_name        : (indirect string, offset: 0x33f): source/gpuFrameBuffer.c	
    <4ce>   DW_AT_comp_dir    : (indirect string, offset: 0x132): /home/robert/Desktop/rasp/chapuzas/template2	
    <4d2>   DW_AT_low_pc      : 0x81e4	
    <4d6>   DW_AT_high_pc     : 0x2e0	
    <4da>   DW_AT_stmt_list   : 0x2d4	
 <1><4de>: Abbrev Number: 2 (DW_TAG_typedef)
    <4df>   DW_AT_name        : (indirect string, offset: 0x30b): __int8_t	
    <4e3>   DW_AT_decl_file   : 2	
    <4e4>   DW_AT_decl_line   : 27	
    <4e5>   DW_AT_type        : <0x4e9>	
 <1><4e9>: Abbrev Number: 3 (DW_TAG_base_type)
    <4ea>   DW_AT_byte_size   : 1	
    <4eb>   DW_AT_encoding    : 6	(signed char)
    <4ec>   DW_AT_name        : (indirect string, offset: 0x55): signed char	
 <1><4f0>: Abbrev Number: 2 (DW_TAG_typedef)
    <4f1>   DW_AT_name        : (indirect string, offset: 0x2c1): __uint8_t	
    <4f5>   DW_AT_decl_file   : 2	
    <4f6>   DW_AT_decl_line   : 28	
    <4f7>   DW_AT_type        : <0x4fb>	
 <1><4fb>: Abbrev Number: 3 (DW_TAG_base_type)
    <4fc>   DW_AT_byte_size   : 1	
    <4fd>   DW_AT_encoding    : 8	(unsigned char)
    <4fe>   DW_AT_name        : (indirect string, offset: 0x53): unsigned char	
 <1><502>: Abbrev Number: 3 (DW_TAG_base_type)
    <503>   DW_AT_byte_size   : 2	
    <504>   DW_AT_encoding    : 5	(signed)
    <505>   DW_AT_name        : (indirect string, offset: 0x121): short int	
 <1><509>: Abbrev Number: 2 (DW_TAG_typedef)
    <50a>   DW_AT_name        : (indirect string, offset: 0x25f): __uint16_t	
    <50e>   DW_AT_decl_file   : 2	
    <50f>   DW_AT_decl_line   : 38	
    <510>   DW_AT_type        : <0x514>	
 <1><514>: Abbrev Number: 3 (DW_TAG_base_type)
    <515>   DW_AT_byte_size   : 2	
    <516>   DW_AT_encoding    : 7	(unsigned)
    <517>   DW_AT_name        : (indirect string, offset: 0xdb): short unsigned int	
 <1><51b>: Abbrev Number: 2 (DW_TAG_typedef)
    <51c>   DW_AT_name        : (indirect string, offset: 0x357): __int32_t	
    <520>   DW_AT_decl_file   : 2	
    <521>   DW_AT_decl_line   : 55	
    <522>   DW_AT_type        : <0x526>	
 <1><526>: Abbrev Number: 3 (DW_TAG_base_type)
    <527>   DW_AT_byte_size   : 4	
    <528>   DW_AT_encoding    : 5	(signed)
    <529>   DW_AT_name        : (indirect string, offset: 0x5): long int	
 <1><52d>: Abbrev Number: 2 (DW_TAG_typedef)
    <52e>   DW_AT_name        : (indirect string, offset: 0xd0): __uint32_t	
    <532>   DW_AT_decl_file   : 2	
    <533>   DW_AT_decl_line   : 56	
    <534>   DW_AT_type        : <0x538>	
 <1><538>: Abbrev Number: 3 (DW_TAG_base_type)
    <539>   DW_AT_byte_size   : 4	
    <53a>   DW_AT_encoding    : 7	(unsigned)
    <53b>   DW_AT_name        : (indirect string, offset: 0x37): long unsigned int	
 <1><53f>: Abbrev Number: 3 (DW_TAG_base_type)
    <540>   DW_AT_byte_size   : 8	
    <541>   DW_AT_encoding    : 5	(signed)
    <542>   DW_AT_name        : (indirect string, offset: 0x0): long long int	
 <1><546>: Abbrev Number: 3 (DW_TAG_base_type)
    <547>   DW_AT_byte_size   : 8	
    <548>   DW_AT_encoding    : 7	(unsigned)
    <549>   DW_AT_name        : (indirect string, offset: 0x32): long long unsigned int	
 <1><54d>: Abbrev Number: 4 (DW_TAG_base_type)
    <54e>   DW_AT_byte_size   : 4	
    <54f>   DW_AT_encoding    : 5	(signed)
    <550>   DW_AT_name        : int	
 <1><554>: Abbrev Number: 3 (DW_TAG_base_type)
    <555>   DW_AT_byte_size   : 4	
    <556>   DW_AT_encoding    : 7	(unsigned)
    <557>   DW_AT_name        : (indirect string, offset: 0x3c): unsigned int	
 <1><55b>: Abbrev Number: 2 (DW_TAG_typedef)
    <55c>   DW_AT_name        : (indirect string, offset: 0x30d): int8_t	
    <560>   DW_AT_decl_file   : 3	
    <561>   DW_AT_decl_line   : 41	
    <562>   DW_AT_type        : <0x4de>	
 <1><566>: Abbrev Number: 2 (DW_TAG_typedef)
    <567>   DW_AT_name        : (indirect string, offset: 0x2c3): uint8_t	
    <56b>   DW_AT_decl_file   : 3	
    <56c>   DW_AT_decl_line   : 42	
    <56d>   DW_AT_type        : <0x4f0>	
 <1><571>: Abbrev Number: 2 (DW_TAG_typedef)
    <572>   DW_AT_name        : (indirect string, offset: 0x261): uint16_t	
    <576>   DW_AT_decl_file   : 3	
    <577>   DW_AT_decl_line   : 54	
    <578>   DW_AT_type        : <0x509>	
 <1><57c>: Abbrev Number: 2 (DW_TAG_typedef)
    <57d>   DW_AT_name        : (indirect string, offset: 0x359): int32_t	
    <581>   DW_AT_decl_file   : 3	
    <582>   DW_AT_decl_line   : 65	
    <583>   DW_AT_type        : <0x51b>	
 <1><587>: Abbrev Number: 2 (DW_TAG_typedef)
    <588>   DW_AT_name        : (indirect string, offset: 0xd2): uint32_t	
    <58c>   DW_AT_decl_file   : 3	
    <58d>   DW_AT_decl_line   : 66	
    <58e>   DW_AT_type        : <0x52d>	
 <1><592>: Abbrev Number: 5 (DW_TAG_structure_type)
    <593>   DW_AT_byte_size   : 40	
    <594>   DW_AT_decl_file   : 4	
    <595>   DW_AT_decl_line   : 34	
    <596>   DW_AT_sibling     : <0x60f>	
 <2><59a>: Abbrev Number: 6 (DW_TAG_member)
    <59b>   DW_AT_name        : (indirect string, offset: 0x231): pWidth	
    <59f>   DW_AT_decl_file   : 4	
    <5a0>   DW_AT_decl_line   : 36	
    <5a1>   DW_AT_type        : <0x60f>	
    <5a5>   DW_AT_data_member_location: 0	
 <2><5a6>: Abbrev Number: 6 (DW_TAG_member)
    <5a7>   DW_AT_name        : (indirect string, offset: 0x31a): pHeight	
    <5ab>   DW_AT_decl_file   : 4	
    <5ac>   DW_AT_decl_line   : 37	
    <5ad>   DW_AT_type        : <0x60f>	
    <5b1>   DW_AT_data_member_location: 4	
 <2><5b2>: Abbrev Number: 6 (DW_TAG_member)
    <5b3>   DW_AT_name        : (indirect string, offset: 0x22a): vWidth	
    <5b7>   DW_AT_decl_file   : 4	
    <5b8>   DW_AT_decl_line   : 38	
    <5b9>   DW_AT_type        : <0x60f>	
    <5bd>   DW_AT_data_member_location: 8	
 <2><5be>: Abbrev Number: 6 (DW_TAG_member)
    <5bf>   DW_AT_name        : (indirect string, offset: 0x2f3): vHeight	
    <5c3>   DW_AT_decl_file   : 4	
    <5c4>   DW_AT_decl_line   : 39	
    <5c5>   DW_AT_type        : <0x60f>	
    <5c9>   DW_AT_data_member_location: 12	
 <2><5ca>: Abbrev Number: 6 (DW_TAG_member)
    <5cb>   DW_AT_name        : (indirect string, offset: 0x3bf): pitch	
    <5cf>   DW_AT_decl_file   : 4	
    <5d0>   DW_AT_decl_line   : 40	
    <5d1>   DW_AT_type        : <0x60f>	
    <5d5>   DW_AT_data_member_location: 16	
 <2><5d6>: Abbrev Number: 6 (DW_TAG_member)
    <5d7>   DW_AT_name        : (indirect string, offset: 0x3d3): cMode	
    <5db>   DW_AT_decl_file   : 4	
    <5dc>   DW_AT_decl_line   : 41	
    <5dd>   DW_AT_type        : <0x60f>	
    <5e1>   DW_AT_data_member_location: 20	
 <2><5e2>: Abbrev Number: 7 (DW_TAG_member)
    <5e3>   DW_AT_name        : x	
    <5e5>   DW_AT_decl_file   : 4	
    <5e6>   DW_AT_decl_line   : 42	
    <5e7>   DW_AT_type        : <0x60f>	
    <5eb>   DW_AT_data_member_location: 24	
 <2><5ec>: Abbrev Number: 7 (DW_TAG_member)
    <5ed>   DW_AT_name        : y	
    <5ef>   DW_AT_decl_file   : 4	
    <5f0>   DW_AT_decl_line   : 43	
    <5f1>   DW_AT_type        : <0x60f>	
    <5f5>   DW_AT_data_member_location: 28	
 <2><5f6>: Abbrev Number: 6 (DW_TAG_member)
    <5f7>   DW_AT_name        : (indirect string, offset: 0x361): pointer	
    <5fb>   DW_AT_decl_file   : 4	
    <5fc>   DW_AT_decl_line   : 44	
    <5fd>   DW_AT_type        : <0x60f>	
    <601>   DW_AT_data_member_location: 32	
 <2><602>: Abbrev Number: 6 (DW_TAG_member)
    <603>   DW_AT_name        : (indirect string, offset: 0x33a): size	
    <607>   DW_AT_decl_file   : 4	
    <608>   DW_AT_decl_line   : 45	
    <609>   DW_AT_type        : <0x60f>	
    <60d>   DW_AT_data_member_location: 36	
 <2><60e>: Abbrev Number: 0
 <1><60f>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <610>   DW_AT_type        : <0x587>	
 <1><614>: Abbrev Number: 2 (DW_TAG_typedef)
    <615>   DW_AT_name        : (indirect string, offset: 0x39e): rpi_gpu_framebuffer_descriptor_t	
    <619>   DW_AT_decl_file   : 4	
    <61a>   DW_AT_decl_line   : 48	
    <61b>   DW_AT_type        : <0x592>	
 <1><61f>: Abbrev Number: 5 (DW_TAG_structure_type)
    <620>   DW_AT_byte_size   : 36	
    <621>   DW_AT_decl_file   : 4	
    <622>   DW_AT_decl_line   : 51	
    <623>   DW_AT_sibling     : <0x694>	
 <2><627>: Abbrev Number: 6 (DW_TAG_member)
    <628>   DW_AT_name        : (indirect string, offset: 0x334): read1	
    <62c>   DW_AT_decl_file   : 4	
    <62d>   DW_AT_decl_line   : 53	
    <62e>   DW_AT_type        : <0x60f>	
    <632>   DW_AT_data_member_location: 0	
 <2><633>: Abbrev Number: 6 (DW_TAG_member)
    <634>   DW_AT_name        : (indirect string, offset: 0x2a8): read2	
    <638>   DW_AT_decl_file   : 4	
    <639>   DW_AT_decl_line   : 54	
    <63a>   DW_AT_type        : <0x60f>	
    <63e>   DW_AT_data_member_location: 4	
 <2><63f>: Abbrev Number: 6 (DW_TAG_member)
    <640>   DW_AT_name        : (indirect string, offset: 0x2ae): read3	
    <644>   DW_AT_decl_file   : 4	
    <645>   DW_AT_decl_line   : 55	
    <646>   DW_AT_type        : <0x60f>	
    <64a>   DW_AT_data_member_location: 8	
 <2><64b>: Abbrev Number: 6 (DW_TAG_member)
    <64c>   DW_AT_name        : (indirect string, offset: 0x2b4): read4	
    <650>   DW_AT_decl_file   : 4	
    <651>   DW_AT_decl_line   : 56	
    <652>   DW_AT_type        : <0x60f>	
    <656>   DW_AT_data_member_location: 12	
 <2><657>: Abbrev Number: 6 (DW_TAG_member)
    <658>   DW_AT_name        : (indirect string, offset: 0x238): poll	
    <65c>   DW_AT_decl_file   : 4	
    <65d>   DW_AT_decl_line   : 57	
    <65e>   DW_AT_type        : <0x60f>	
    <662>   DW_AT_data_member_location: 16	
 <2><663>: Abbrev Number: 6 (DW_TAG_member)
    <664>   DW_AT_name        : (indirect string, offset: 0x274): sender	
    <668>   DW_AT_decl_file   : 4	
    <669>   DW_AT_decl_line   : 58	
    <66a>   DW_AT_type        : <0x60f>	
    <66e>   DW_AT_data_member_location: 20	
 <2><66f>: Abbrev Number: 6 (DW_TAG_member)
    <670>   DW_AT_name        : (indirect string, offset: 0x1ad): status	
    <674>   DW_AT_decl_file   : 4	
    <675>   DW_AT_decl_line   : 59	
    <676>   DW_AT_type        : <0x60f>	
    <67a>   DW_AT_data_member_location: 24	
 <2><67b>: Abbrev Number: 6 (DW_TAG_member)
    <67c>   DW_AT_name        : (indirect string, offset: 0x2de): configuration	
    <680>   DW_AT_decl_file   : 4	
    <681>   DW_AT_decl_line   : 60	
    <682>   DW_AT_type        : <0x60f>	
    <686>   DW_AT_data_member_location: 28	
 <2><687>: Abbrev Number: 6 (DW_TAG_member)
    <688>   DW_AT_name        : (indirect string, offset: 0x314): write	
    <68c>   DW_AT_decl_file   : 4	
    <68d>   DW_AT_decl_line   : 61	
    <68e>   DW_AT_type        : <0x60f>	
    <692>   DW_AT_data_member_location: 32	
 <2><693>: Abbrev Number: 0
 <1><694>: Abbrev Number: 2 (DW_TAG_typedef)
    <695>   DW_AT_name        : (indirect string, offset: 0x369): rpi_gpu_mailbox_t	
    <699>   DW_AT_decl_file   : 4	
    <69a>   DW_AT_decl_line   : 62	
    <69b>   DW_AT_type        : <0x61f>	
 <1><69f>: Abbrev Number: 9 (DW_TAG_subprogram)
    <6a0>   DW_AT_external    : 1	
    <6a0>   DW_AT_name        : (indirect string, offset: 0x3d9): setPixel	
    <6a4>   DW_AT_decl_file   : 1	
    <6a5>   DW_AT_decl_line   : 62	
    <6a6>   DW_AT_prototyped  : 1	
    <6a6>   DW_AT_inline      : 1	(inlined)
    <6a7>   DW_AT_sibling     : <0x6e3>	
 <2><6ab>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <6ac>   DW_AT_name        : (indirect string, offset: 0x37b): posX	
    <6b0>   DW_AT_decl_file   : 1	
    <6b1>   DW_AT_decl_line   : 62	
    <6b2>   DW_AT_type        : <0x57c>	
 <2><6b6>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <6b7>   DW_AT_name        : (indirect string, offset: 0x380): posY	
    <6bb>   DW_AT_decl_file   : 1	
    <6bc>   DW_AT_decl_line   : 62	
    <6bd>   DW_AT_type        : <0x57c>	
 <2><6c1>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <6c2>   DW_AT_name        : (indirect string, offset: 0x26a): Colour16b	
    <6c6>   DW_AT_decl_file   : 1	
    <6c7>   DW_AT_decl_line   : 62	
    <6c8>   DW_AT_type        : <0x571>	
 <2><6cc>: Abbrev Number: 11 (DW_TAG_variable)
    <6cd>   DW_AT_name        : ptr	
    <6d1>   DW_AT_decl_file   : 1	
    <6d2>   DW_AT_decl_line   : 65	
    <6d3>   DW_AT_type        : <0x6e3>	
 <2><6d7>: Abbrev Number: 12 (DW_TAG_variable)
    <6d8>   DW_AT_name        : (indirect string, offset: 0x2ba): offset	
    <6dc>   DW_AT_decl_file   : 1	
    <6dd>   DW_AT_decl_line   : 66	
    <6de>   DW_AT_type        : <0x587>	
 <2><6e2>: Abbrev Number: 0
 <1><6e3>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <6e4>   DW_AT_byte_size   : 4	
    <6e5>   DW_AT_type        : <0x571>	
 <1><6e9>: Abbrev Number: 14 (DW_TAG_subprogram)
    <6ea>   DW_AT_external    : 1	
    <6ea>   DW_AT_name        : (indirect string, offset: 0x385): RPI_GetFrameBufferDescpr	
    <6ee>   DW_AT_decl_file   : 1	
    <6ef>   DW_AT_decl_line   : 13	
    <6f0>   DW_AT_prototyped  : 1	
    <6f0>   DW_AT_type        : <0x6fe>	
    <6f4>   DW_AT_low_pc      : 0x81e4	
    <6f8>   DW_AT_high_pc     : 0xc	
    <6fc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6fe>   DW_AT_GNU_all_call_sites: 1	
 <1><6fe>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <6ff>   DW_AT_byte_size   : 4	
    <700>   DW_AT_type        : <0x614>	
 <1><704>: Abbrev Number: 15 (DW_TAG_subprogram)
    <705>   DW_AT_external    : 1	
    <705>   DW_AT_name        : (indirect string, offset: 0x212): paintEntireScreen	
    <709>   DW_AT_decl_file   : 1	
    <70a>   DW_AT_decl_line   : 19	
    <70b>   DW_AT_prototyped  : 1	
    <70b>   DW_AT_low_pc      : 0x81f0	
    <70f>   DW_AT_high_pc     : 0x5c	
    <713>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <715>   DW_AT_GNU_all_call_sites: 1	
    <715>   DW_AT_sibling     : <0x74e>	
 <2><719>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <71a>   DW_AT_name        : (indirect string, offset: 0x26a): Colour16b	
    <71e>   DW_AT_decl_file   : 1	
    <71f>   DW_AT_decl_line   : 19	
    <720>   DW_AT_type        : <0x571>	
    <724>   DW_AT_location    : 1 byte block: 50 	(DW_OP_reg0 (r0))
 <2><726>: Abbrev Number: 17 (DW_TAG_variable)
    <727>   DW_AT_name        : (indirect string, offset: 0x224): pixel	
    <72b>   DW_AT_decl_file   : 1	
    <72c>   DW_AT_decl_line   : 21	
    <72d>   DW_AT_type        : <0x6e3>	
    <731>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (r2))
 <2><733>: Abbrev Number: 18 (DW_TAG_variable)
    <734>   DW_AT_name        : x	
    <736>   DW_AT_decl_file   : 1	
    <737>   DW_AT_decl_line   : 22	
    <738>   DW_AT_type        : <0x587>	
    <73c>   DW_AT_location    : 0x60	(location list)
 <2><740>: Abbrev Number: 18 (DW_TAG_variable)
    <741>   DW_AT_name        : y	
    <743>   DW_AT_decl_file   : 1	
    <744>   DW_AT_decl_line   : 22	
    <745>   DW_AT_type        : <0x587>	
    <749>   DW_AT_location    : 0x7f	(location list)
 <2><74d>: Abbrev Number: 0
 <1><74e>: Abbrev Number: 15 (DW_TAG_subprogram)
    <74f>   DW_AT_external    : 1	
    <74f>   DW_AT_name        : (indirect string, offset: 0x4c2): line	
    <753>   DW_AT_decl_file   : 1	
    <754>   DW_AT_decl_line   : 28	
    <755>   DW_AT_prototyped  : 1	
    <755>   DW_AT_low_pc      : 0x824c	
    <759>   DW_AT_high_pc     : 0xf8	
    <75d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <75f>   DW_AT_GNU_all_call_sites: 1	
    <75f>   DW_AT_sibling     : <0x830>	
 <2><763>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <764>   DW_AT_name        : x0	
    <767>   DW_AT_decl_file   : 1	
    <768>   DW_AT_decl_line   : 28	
    <769>   DW_AT_type        : <0x57c>	
    <76d>   DW_AT_location    : 0x9e	(location list)
 <2><771>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <772>   DW_AT_name        : y0	
    <775>   DW_AT_decl_file   : 1	
    <776>   DW_AT_decl_line   : 28	
    <777>   DW_AT_type        : <0x57c>	
    <77b>   DW_AT_location    : 0xbc	(location list)
 <2><77f>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <780>   DW_AT_name        : x1	
    <783>   DW_AT_decl_file   : 1	
    <784>   DW_AT_decl_line   : 28	
    <785>   DW_AT_type        : <0x57c>	
    <789>   DW_AT_location    : 0xda	(location list)
 <2><78d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <78e>   DW_AT_name        : y1	
    <791>   DW_AT_decl_file   : 1	
    <792>   DW_AT_decl_line   : 28	
    <793>   DW_AT_type        : <0x57c>	
    <797>   DW_AT_location    : 0x106	(location list)
 <2><79b>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <79c>   DW_AT_name        : (indirect string, offset: 0x26a): Colour16b	
    <7a0>   DW_AT_decl_file   : 1	
    <7a1>   DW_AT_decl_line   : 28	
    <7a2>   DW_AT_type        : <0x571>	
    <7a6>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><7a9>: Abbrev Number: 18 (DW_TAG_variable)
    <7aa>   DW_AT_name        : dx	
    <7ad>   DW_AT_decl_file   : 1	
    <7ae>   DW_AT_decl_line   : 29	
    <7af>   DW_AT_type        : <0x57c>	
    <7b3>   DW_AT_location    : 0x132	(location list)
 <2><7b7>: Abbrev Number: 18 (DW_TAG_variable)
    <7b8>   DW_AT_name        : sx	
    <7bb>   DW_AT_decl_file   : 1	
    <7bc>   DW_AT_decl_line   : 30	
    <7bd>   DW_AT_type        : <0x57c>	
    <7c1>   DW_AT_location    : 0x15b	(location list)
 <2><7c5>: Abbrev Number: 18 (DW_TAG_variable)
    <7c6>   DW_AT_name        : dy	
    <7c9>   DW_AT_decl_file   : 1	
    <7ca>   DW_AT_decl_line   : 31	
    <7cb>   DW_AT_type        : <0x57c>	
    <7cf>   DW_AT_location    : 0x179	(location list)
 <2><7d3>: Abbrev Number: 18 (DW_TAG_variable)
    <7d4>   DW_AT_name        : sy	
    <7d7>   DW_AT_decl_file   : 1	
    <7d8>   DW_AT_decl_line   : 32	
    <7d9>   DW_AT_type        : <0x57c>	
    <7dd>   DW_AT_location    : 0x1a3	(location list)
 <2><7e1>: Abbrev Number: 18 (DW_TAG_variable)
    <7e2>   DW_AT_name        : err	
    <7e6>   DW_AT_decl_file   : 1	
    <7e7>   DW_AT_decl_line   : 33	
    <7e8>   DW_AT_type        : <0x57c>	
    <7ec>   DW_AT_location    : 0x1b7	(location list)
 <2><7f0>: Abbrev Number: 20 (DW_TAG_inlined_subroutine)
    <7f1>   DW_AT_abstract_origin: <0x69f>	
    <7f5>   DW_AT_entry_pc    : 0x8298	
    <7f9>   DW_AT_ranges      : 0x10	
    <7fd>   DW_AT_call_file   : 1	
    <7fe>   DW_AT_call_line   : 42	
 <3><7ff>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <800>   DW_AT_abstract_origin: <0x6c1>	
 <3><804>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <805>   DW_AT_abstract_origin: <0x6b6>	
    <809>   DW_AT_location    : 0x1d5	(location list)
 <3><80d>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <80e>   DW_AT_abstract_origin: <0x6ab>	
    <812>   DW_AT_location    : 0x1e8	(location list)
 <3><816>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <817>   DW_AT_ranges      : 0x10	
 <4><81b>: Abbrev Number: 24 (DW_TAG_variable)
    <81c>   DW_AT_abstract_origin: <0x6cc>	
    <820>   DW_AT_location    : 0x206	(location list)
 <4><824>: Abbrev Number: 24 (DW_TAG_variable)
    <825>   DW_AT_abstract_origin: <0x6d7>	
    <829>   DW_AT_location    : 0x226	(location list)
 <4><82d>: Abbrev Number: 0
 <3><82e>: Abbrev Number: 0
 <2><82f>: Abbrev Number: 0
 <1><830>: Abbrev Number: 25 (DW_TAG_subprogram)
    <831>   DW_AT_abstract_origin: <0x69f>	
    <835>   DW_AT_low_pc      : 0x8344	
    <839>   DW_AT_high_pc     : 0x34	
    <83d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <83f>   DW_AT_GNU_all_call_sites: 1	
    <83f>   DW_AT_sibling     : <0x86f>	
 <2><843>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <844>   DW_AT_abstract_origin: <0x6ab>	
    <848>   DW_AT_location    : 0x243	(location list)
 <2><84c>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <84d>   DW_AT_abstract_origin: <0x6b6>	
    <851>   DW_AT_location    : 0x264	(location list)
 <2><855>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <856>   DW_AT_abstract_origin: <0x6c1>	
    <85a>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (r2))
 <2><85c>: Abbrev Number: 24 (DW_TAG_variable)
    <85d>   DW_AT_abstract_origin: <0x6cc>	
    <861>   DW_AT_location    : 0x285	(location list)
 <2><865>: Abbrev Number: 24 (DW_TAG_variable)
    <866>   DW_AT_abstract_origin: <0x6d7>	
    <86a>   DW_AT_location    : 0x2d8	(location list)
 <2><86e>: Abbrev Number: 0
 <1><86f>: Abbrev Number: 27 (DW_TAG_subprogram)
    <870>   DW_AT_external    : 1	
    <870>   DW_AT_name        : (indirect string, offset: 0x27b): drawCharacter	
    <874>   DW_AT_decl_file   : 1	
    <875>   DW_AT_decl_line   : 78	
    <876>   DW_AT_prototyped  : 1	
    <876>   DW_AT_type        : <0x55b>	
    <87a>   DW_AT_low_pc      : 0x8378	
    <87e>   DW_AT_high_pc     : 0xb4	
    <882>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <884>   DW_AT_GNU_all_call_sites: 1	
    <884>   DW_AT_sibling     : <0x921>	
 <2><888>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <889>   DW_AT_name        : (indirect string, offset: 0x538): Char	
    <88d>   DW_AT_decl_file   : 1	
    <88e>   DW_AT_decl_line   : 78	
    <88f>   DW_AT_type        : <0x566>	
    <893>   DW_AT_location    : 0x322	(location list)
 <2><897>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <898>   DW_AT_name        : x	
    <89a>   DW_AT_decl_file   : 1	
    <89b>   DW_AT_decl_line   : 78	
    <89c>   DW_AT_type        : <0x587>	
    <8a0>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (r1))
 <2><8a2>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <8a3>   DW_AT_name        : y	
    <8a5>   DW_AT_decl_file   : 1	
    <8a6>   DW_AT_decl_line   : 78	
    <8a7>   DW_AT_type        : <0x587>	
    <8ab>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (r2))
 <2><8ad>: Abbrev Number: 18 (DW_TAG_variable)
    <8ae>   DW_AT_name        : bit	
    <8b2>   DW_AT_decl_file   : 1	
    <8b3>   DW_AT_decl_line   : 80	
    <8b4>   DW_AT_type        : <0x566>	
    <8b8>   DW_AT_location    : 0x357	(location list)
 <2><8bc>: Abbrev Number: 30 (DW_TAG_variable)
    <8bd>   DW_AT_name        : (indirect string, offset: 0x207): readedBits	
    <8c1>   DW_AT_decl_file   : 1	
    <8c2>   DW_AT_decl_line   : 81	
    <8c3>   DW_AT_type        : <0x566>	
    <8c7>   DW_AT_location    : 0x383	(location list)
 <2><8cb>: Abbrev Number: 18 (DW_TAG_variable)
    <8cc>   DW_AT_name        : row	
    <8d0>   DW_AT_decl_file   : 1	
    <8d1>   DW_AT_decl_line   : 82	
    <8d2>   DW_AT_type        : <0x566>	
    <8d6>   DW_AT_location    : 0x3a5	(location list)
 <2><8da>: Abbrev Number: 30 (DW_TAG_variable)
    <8db>   DW_AT_name        : (indirect string, offset: 0x2cb): currentCharAddress	
    <8df>   DW_AT_decl_file   : 1	
    <8e0>   DW_AT_decl_line   : 83	
    <8e1>   DW_AT_type        : <0x921>	
    <8e5>   DW_AT_location    : 0x3dc	(location list)
 <2><8e9>: Abbrev Number: 20 (DW_TAG_inlined_subroutine)
    <8ea>   DW_AT_abstract_origin: <0x69f>	
    <8ee>   DW_AT_entry_pc    : 0x8394	
    <8f2>   DW_AT_ranges      : 0x28	
    <8f6>   DW_AT_call_file   : 1	
    <8f7>   DW_AT_call_line   : 97	
 <3><8f8>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <8f9>   DW_AT_abstract_origin: <0x6c1>	
    <8fd>   DW_AT_location    : 0x3ef	(location list)
 <3><901>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <902>   DW_AT_abstract_origin: <0x6b6>	
 <3><906>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <907>   DW_AT_abstract_origin: <0x6ab>	
    <90b>   DW_AT_location    : 0x405	(location list)
 <3><90f>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <910>   DW_AT_ranges      : 0x28	
 <4><914>: Abbrev Number: 31 (DW_TAG_variable)
    <915>   DW_AT_abstract_origin: <0x6cc>	
 <4><919>: Abbrev Number: 31 (DW_TAG_variable)
    <91a>   DW_AT_abstract_origin: <0x6d7>	
 <4><91e>: Abbrev Number: 0
 <3><91f>: Abbrev Number: 0
 <2><920>: Abbrev Number: 0
 <1><921>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <922>   DW_AT_byte_size   : 4	
    <923>   DW_AT_type        : <0x566>	
 <1><927>: Abbrev Number: 27 (DW_TAG_subprogram)
    <928>   DW_AT_external    : 1	
    <928>   DW_AT_name        : (indirect string, offset: 0x254): drawString	
    <92c>   DW_AT_decl_file   : 1	
    <92d>   DW_AT_decl_line   : 106	
    <92e>   DW_AT_prototyped  : 1	
    <92e>   DW_AT_type        : <0x55b>	
    <932>   DW_AT_low_pc      : 0x842c	
    <936>   DW_AT_high_pc     : 0x98	
    <93a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <93c>   DW_AT_GNU_all_call_sites: 1	
    <93c>   DW_AT_sibling     : <0x9a9>	
 <2><940>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <941>   DW_AT_name        : (indirect string, offset: 0x24d): string	
    <945>   DW_AT_decl_file   : 1	
    <946>   DW_AT_decl_line   : 106	
    <947>   DW_AT_type        : <0x921>	
    <94b>   DW_AT_location    : 0x425	(location list)
 <2><94f>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <950>   DW_AT_name        : (indirect string, offset: 0x2ec): length	
    <954>   DW_AT_decl_file   : 1	
    <955>   DW_AT_decl_line   : 106	
    <956>   DW_AT_type        : <0x587>	
    <95a>   DW_AT_location    : 0x443	(location list)
 <2><95e>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <95f>   DW_AT_name        : x	
    <961>   DW_AT_decl_file   : 1	
    <962>   DW_AT_decl_line   : 106	
    <963>   DW_AT_type        : <0x587>	
    <967>   DW_AT_location    : 0x47c	(location list)
 <2><96b>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <96c>   DW_AT_name        : y	
    <96e>   DW_AT_decl_file   : 1	
    <96f>   DW_AT_decl_line   : 106	
    <970>   DW_AT_type        : <0x587>	
    <974>   DW_AT_location    : 0x4bb	(location list)
 <2><978>: Abbrev Number: 18 (DW_TAG_variable)
    <979>   DW_AT_name        : x0	
    <97c>   DW_AT_decl_file   : 1	
    <97d>   DW_AT_decl_line   : 108	
    <97e>   DW_AT_type        : <0x587>	
    <982>   DW_AT_location    : 0x4e4	(location list)
 <2><986>: Abbrev Number: 11 (DW_TAG_variable)
    <987>   DW_AT_name        : x1	
    <98a>   DW_AT_decl_file   : 1	
    <98b>   DW_AT_decl_line   : 109	
    <98c>   DW_AT_type        : <0x587>	
 <2><990>: Abbrev Number: 30 (DW_TAG_variable)
    <991>   DW_AT_name        : (indirect string, offset: 0x29f): nextChar	
    <995>   DW_AT_decl_file   : 1	
    <996>   DW_AT_decl_line   : 110	
    <997>   DW_AT_type        : <0x566>	
    <99b>   DW_AT_location    : 0x50d	(location list)
 <2><99f>: Abbrev Number: 32 (DW_TAG_GNU_call_site)
    <9a0>   DW_AT_low_pc      : 0x8498	
    <9a4>   DW_AT_abstract_origin: <0x86f>	
 <2><9a8>: Abbrev Number: 0
 <1><9a9>: Abbrev Number: 12 (DW_TAG_variable)
    <9aa>   DW_AT_name        : (indirect string, offset: 0x322): FrameBufferDescrp	
    <9ae>   DW_AT_decl_file   : 1	
    <9af>   DW_AT_decl_line   : 6	
    <9b0>   DW_AT_type        : <0x9b4>	
 <1><9b4>: Abbrev Number: 33 (DW_TAG_const_type)
    <9b5>   DW_AT_type        : <0x6fe>	
 <1><9b9>: Abbrev Number: 34 (DW_TAG_variable)
    <9ba>   DW_AT_name        : (indirect string, offset: 0x3c5): rpiGpuMailbox	
    <9be>   DW_AT_decl_file   : 1	
    <9bf>   DW_AT_decl_line   : 7	
    <9c0>   DW_AT_type        : <0x9c8>	
    <9c4>   DW_AT_const_value : 0x2000b880	
 <1><9c8>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <9c9>   DW_AT_byte_size   : 4	
    <9ca>   DW_AT_type        : <0x694>	
 <1><9ce>: Abbrev Number: 12 (DW_TAG_variable)
    <9cf>   DW_AT_name        : (indirect string, offset: 0x2fb): fontInfoAddress	
    <9d3>   DW_AT_decl_file   : 1	
    <9d4>   DW_AT_decl_line   : 8	
    <9d5>   DW_AT_type        : <0x9d9>	
 <1><9d9>: Abbrev Number: 33 (DW_TAG_const_type)
    <9da>   DW_AT_type        : <0x921>	
 <1><9de>: Abbrev Number: 35 (DW_TAG_variable)
    <9df>   DW_AT_name        : (indirect string, offset: 0x23d): FrameBufferInfo	
    <9e3>   DW_AT_decl_file   : 1	
    <9e4>   DW_AT_decl_line   : 3	
    <9e5>   DW_AT_type        : <0x54d>	
    <9e9>   DW_AT_external    : 1	
    <9e9>   DW_AT_declaration : 1	
 <1><9e9>: Abbrev Number: 35 (DW_TAG_variable)
    <9ea>   DW_AT_name        : (indirect string, offset: 0x289): SystemDefaultFontInfo	
    <9ee>   DW_AT_decl_file   : 1	
    <9ef>   DW_AT_decl_line   : 4	
    <9f0>   DW_AT_type        : <0x54d>	
    <9f4>   DW_AT_external    : 1	
    <9f4>   DW_AT_declaration : 1	
 <1><9f4>: Abbrev Number: 0
  Compilation Unit @ offset 0x9f5:
   Length:        0x2ae (32-bit)
   Version:       4
   Abbrev Offset: 0x449
   Pointer Size:  4
 <0><a00>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <a01>   DW_AT_producer    : (indirect string, offset: 0x7f): GNU C 4.8.2 -mfpu=vfp -mfloat-abi=hard -march=armv6zk -mtune=arm1176jzf-s -g -O2	
    <a05>   DW_AT_language    : 1	(ANSI C)
    <a06>   DW_AT_name        : (indirect string, offset: 0x40c): source/string.c	
    <a0a>   DW_AT_comp_dir    : (indirect string, offset: 0x132): /home/robert/Desktop/rasp/chapuzas/template2	
    <a0e>   DW_AT_low_pc      : 0x84c4	
    <a12>   DW_AT_high_pc     : 0x228	
    <a16>   DW_AT_stmt_list   : 0x497	
 <1><a1a>: Abbrev Number: 2 (DW_TAG_typedef)
    <a1b>   DW_AT_name        : (indirect string, offset: 0x30b): __int8_t	
    <a1f>   DW_AT_decl_file   : 2	
    <a20>   DW_AT_decl_line   : 27	
    <a21>   DW_AT_type        : <0xa25>	
 <1><a25>: Abbrev Number: 3 (DW_TAG_base_type)
    <a26>   DW_AT_byte_size   : 1	
    <a27>   DW_AT_encoding    : 6	(signed char)
    <a28>   DW_AT_name        : (indirect string, offset: 0x55): signed char	
 <1><a2c>: Abbrev Number: 2 (DW_TAG_typedef)
    <a2d>   DW_AT_name        : (indirect string, offset: 0x2c1): __uint8_t	
    <a31>   DW_AT_decl_file   : 2	
    <a32>   DW_AT_decl_line   : 28	
    <a33>   DW_AT_type        : <0xa37>	
 <1><a37>: Abbrev Number: 3 (DW_TAG_base_type)
    <a38>   DW_AT_byte_size   : 1	
    <a39>   DW_AT_encoding    : 8	(unsigned char)
    <a3a>   DW_AT_name        : (indirect string, offset: 0x53): unsigned char	
 <1><a3e>: Abbrev Number: 3 (DW_TAG_base_type)
    <a3f>   DW_AT_byte_size   : 2	
    <a40>   DW_AT_encoding    : 5	(signed)
    <a41>   DW_AT_name        : (indirect string, offset: 0x121): short int	
 <1><a45>: Abbrev Number: 3 (DW_TAG_base_type)
    <a46>   DW_AT_byte_size   : 2	
    <a47>   DW_AT_encoding    : 7	(unsigned)
    <a48>   DW_AT_name        : (indirect string, offset: 0xdb): short unsigned int	
 <1><a4c>: Abbrev Number: 3 (DW_TAG_base_type)
    <a4d>   DW_AT_byte_size   : 4	
    <a4e>   DW_AT_encoding    : 5	(signed)
    <a4f>   DW_AT_name        : (indirect string, offset: 0x5): long int	
 <1><a53>: Abbrev Number: 2 (DW_TAG_typedef)
    <a54>   DW_AT_name        : (indirect string, offset: 0xd0): __uint32_t	
    <a58>   DW_AT_decl_file   : 2	
    <a59>   DW_AT_decl_line   : 56	
    <a5a>   DW_AT_type        : <0xa5e>	
 <1><a5e>: Abbrev Number: 3 (DW_TAG_base_type)
    <a5f>   DW_AT_byte_size   : 4	
    <a60>   DW_AT_encoding    : 7	(unsigned)
    <a61>   DW_AT_name        : (indirect string, offset: 0x37): long unsigned int	
 <1><a65>: Abbrev Number: 3 (DW_TAG_base_type)
    <a66>   DW_AT_byte_size   : 8	
    <a67>   DW_AT_encoding    : 5	(signed)
    <a68>   DW_AT_name        : (indirect string, offset: 0x0): long long int	
 <1><a6c>: Abbrev Number: 3 (DW_TAG_base_type)
    <a6d>   DW_AT_byte_size   : 8	
    <a6e>   DW_AT_encoding    : 7	(unsigned)
    <a6f>   DW_AT_name        : (indirect string, offset: 0x32): long long unsigned int	
 <1><a73>: Abbrev Number: 4 (DW_TAG_base_type)
    <a74>   DW_AT_byte_size   : 4	
    <a75>   DW_AT_encoding    : 5	(signed)
    <a76>   DW_AT_name        : int	
 <1><a7a>: Abbrev Number: 3 (DW_TAG_base_type)
    <a7b>   DW_AT_byte_size   : 4	
    <a7c>   DW_AT_encoding    : 7	(unsigned)
    <a7d>   DW_AT_name        : (indirect string, offset: 0x3c): unsigned int	
 <1><a81>: Abbrev Number: 2 (DW_TAG_typedef)
    <a82>   DW_AT_name        : (indirect string, offset: 0x30d): int8_t	
    <a86>   DW_AT_decl_file   : 3	
    <a87>   DW_AT_decl_line   : 41	
    <a88>   DW_AT_type        : <0xa1a>	
 <1><a8c>: Abbrev Number: 2 (DW_TAG_typedef)
    <a8d>   DW_AT_name        : (indirect string, offset: 0x2c3): uint8_t	
    <a91>   DW_AT_decl_file   : 3	
    <a92>   DW_AT_decl_line   : 42	
    <a93>   DW_AT_type        : <0xa2c>	
 <1><a97>: Abbrev Number: 2 (DW_TAG_typedef)
    <a98>   DW_AT_name        : (indirect string, offset: 0xd2): uint32_t	
    <a9c>   DW_AT_decl_file   : 3	
    <a9d>   DW_AT_decl_line   : 66	
    <a9e>   DW_AT_type        : <0xa53>	
 <1><aa2>: Abbrev Number: 5 (DW_TAG_subprogram)
    <aa3>   DW_AT_external    : 1	
    <aa3>   DW_AT_name        : (indirect string, offset: 0x3ff): stringLength	
    <aa7>   DW_AT_decl_file   : 1	
    <aa8>   DW_AT_decl_line   : 65	
    <aa9>   DW_AT_prototyped  : 1	
    <aa9>   DW_AT_type        : <0xa8c>	
    <aad>   DW_AT_inline      : 1	(inlined)
    <aae>   DW_AT_sibling     : <0xac9>	
 <2><ab2>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <ab3>   DW_AT_name        : str	
    <ab7>   DW_AT_decl_file   : 1	
    <ab8>   DW_AT_decl_line   : 65	
    <ab9>   DW_AT_type        : <0xac9>	
 <2><abd>: Abbrev Number: 7 (DW_TAG_variable)
    <abe>   DW_AT_name        : (indirect string, offset: 0x460): cont	
    <ac2>   DW_AT_decl_file   : 1	
    <ac3>   DW_AT_decl_line   : 67	
    <ac4>   DW_AT_type        : <0xa8c>	
 <2><ac8>: Abbrev Number: 0
 <1><ac9>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <aca>   DW_AT_byte_size   : 4	
    <acb>   DW_AT_type        : <0xa8c>	
 <1><acf>: Abbrev Number: 9 (DW_TAG_subprogram)
    <ad0>   DW_AT_external    : 1	
    <ad0>   DW_AT_name        : (indirect string, offset: 0x3eb): uintToString	
    <ad4>   DW_AT_decl_file   : 1	
    <ad5>   DW_AT_decl_line   : 5	
    <ad6>   DW_AT_prototyped  : 1	
    <ad6>   DW_AT_type        : <0xa81>	
    <ada>   DW_AT_low_pc      : 0x84c4	
    <ade>   DW_AT_high_pc     : 0x120	
    <ae2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ae4>   DW_AT_GNU_all_tail_call_sites: 1	
    <ae4>   DW_AT_sibling     : <0xb69>	
 <2><ae8>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <ae9>   DW_AT_name        : num	
    <aed>   DW_AT_decl_file   : 1	
    <aee>   DW_AT_decl_line   : 5	
    <aef>   DW_AT_type        : <0xa97>	
    <af3>   DW_AT_location    : 0x550	(location list)
 <2><af7>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <af8>   DW_AT_name        : (indirect string, offset: 0x42e): base	
    <afc>   DW_AT_decl_file   : 1	
    <afd>   DW_AT_decl_line   : 5	
    <afe>   DW_AT_type        : <0xa8c>	
    <b02>   DW_AT_location    : 0x5c6	(location list)
 <2><b06>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <b07>   DW_AT_name        : str	
    <b0b>   DW_AT_decl_file   : 1	
    <b0c>   DW_AT_decl_line   : 5	
    <b0d>   DW_AT_type        : <0xac9>	
    <b11>   DW_AT_location    : 0x5f2	(location list)
 <2><b15>: Abbrev Number: 12 (DW_TAG_variable)
    <b16>   DW_AT_name        : (indirect string, offset: 0x43c): divCont	
    <b1a>   DW_AT_decl_file   : 1	
    <b1b>   DW_AT_decl_line   : 7	
    <b1c>   DW_AT_type        : <0xa8c>	
    <b20>   DW_AT_location    : 0x61b	(location list)
 <2><b24>: Abbrev Number: 12 (DW_TAG_variable)
    <b25>   DW_AT_name        : (indirect string, offset: 0x3e2): reminder	
    <b29>   DW_AT_decl_file   : 1	
    <b2a>   DW_AT_decl_line   : 8	
    <b2b>   DW_AT_type        : <0xa8c>	
    <b2f>   DW_AT_location    : 0x698	(location list)
 <2><b33>: Abbrev Number: 13 (DW_TAG_variable)
    <b34>   DW_AT_name        : i	
    <b36>   DW_AT_decl_file   : 1	
    <b37>   DW_AT_decl_line   : 9	
    <b38>   DW_AT_type        : <0xa8c>	
    <b3c>   DW_AT_location    : 0x6f4	(location list)
 <2><b40>: Abbrev Number: 14 (DW_TAG_inlined_subroutine)
    <b41>   DW_AT_abstract_origin: <0xaa2>	
    <b45>   DW_AT_low_pc      : 0x84dc	
    <b49>   DW_AT_high_pc     : 0x24	
    <b4d>   DW_AT_call_file   : 1	
    <b4e>   DW_AT_call_line   : 14	
 <3><b4f>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <b50>   DW_AT_abstract_origin: <0xab2>	
 <3><b54>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <b55>   DW_AT_low_pc      : 0x84dc	
    <b59>   DW_AT_high_pc     : 0x24	
 <4><b5d>: Abbrev Number: 17 (DW_TAG_variable)
    <b5e>   DW_AT_abstract_origin: <0xabd>	
    <b62>   DW_AT_location    : 0x71e	(location list)
 <4><b66>: Abbrev Number: 0
 <3><b67>: Abbrev Number: 0
 <2><b68>: Abbrev Number: 0
 <1><b69>: Abbrev Number: 18 (DW_TAG_subprogram)
    <b6a>   DW_AT_abstract_origin: <0xaa2>	
    <b6e>   DW_AT_low_pc      : 0x85e4	
    <b72>   DW_AT_high_pc     : 0x2c	
    <b76>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b78>   DW_AT_GNU_all_call_sites: 1	
    <b78>   DW_AT_sibling     : <0xb8f>	
 <2><b7c>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <b7d>   DW_AT_abstract_origin: <0xab2>	
    <b81>   DW_AT_location    : 0x760	(location list)
 <2><b85>: Abbrev Number: 17 (DW_TAG_variable)
    <b86>   DW_AT_abstract_origin: <0xabd>	
    <b8a>   DW_AT_location    : 0x77e	(location list)
 <2><b8e>: Abbrev Number: 0
 <1><b8f>: Abbrev Number: 20 (DW_TAG_subprogram)
    <b90>   DW_AT_external    : 1	
    <b90>   DW_AT_name        : (indirect string, offset: 0x44c): searchStringPattern	
    <b94>   DW_AT_decl_file   : 1	
    <b95>   DW_AT_decl_line   : 75	
    <b96>   DW_AT_prototyped  : 1	
    <b96>   DW_AT_type        : <0xa97>	
    <b9a>   DW_AT_low_pc      : 0x8610	
    <b9e>   DW_AT_high_pc     : 0x84	
    <ba2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ba4>   DW_AT_GNU_all_call_sites: 1	
    <ba4>   DW_AT_sibling     : <0xbe3>	
 <2><ba8>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <ba9>   DW_AT_name        : (indirect string, offset: 0x444): pattern	
    <bad>   DW_AT_decl_file   : 1	
    <bae>   DW_AT_decl_line   : 75	
    <baf>   DW_AT_type        : <0xac9>	
    <bb3>   DW_AT_location    : 0x7b5	(location list)
 <2><bb7>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <bb8>   DW_AT_name        : str	
    <bbc>   DW_AT_decl_file   : 1	
    <bbd>   DW_AT_decl_line   : 75	
    <bbe>   DW_AT_type        : <0xbe3>	
    <bc2>   DW_AT_location    : 0x7fa	(location list)
 <2><bc6>: Abbrev Number: 13 (DW_TAG_variable)
    <bc7>   DW_AT_name        : i	
    <bc9>   DW_AT_decl_file   : 1	
    <bca>   DW_AT_decl_line   : 78	
    <bcb>   DW_AT_type        : <0xa97>	
    <bcf>   DW_AT_location    : 0x83f	(location list)
 <2><bd3>: Abbrev Number: 12 (DW_TAG_variable)
    <bd4>   DW_AT_name        : (indirect string, offset: 0x465): equals	
    <bd8>   DW_AT_decl_file   : 1	
    <bd9>   DW_AT_decl_line   : 79	
    <bda>   DW_AT_type        : <0xa97>	
    <bde>   DW_AT_location    : 0x876	(location list)
 <2><be2>: Abbrev Number: 0
 <1><be3>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <be4>   DW_AT_byte_size   : 4	
    <be5>   DW_AT_type        : <0xbe9>	
 <1><be9>: Abbrev Number: 21 (DW_TAG_const_type)
    <bea>   DW_AT_type        : <0xa8c>	
 <1><bee>: Abbrev Number: 20 (DW_TAG_subprogram)
    <bef>   DW_AT_external    : 1	
    <bef>   DW_AT_name        : (indirect string, offset: 0x3f8): strcpy	
    <bf3>   DW_AT_decl_file   : 1	
    <bf4>   DW_AT_decl_line   : 94	
    <bf5>   DW_AT_prototyped  : 1	
    <bf5>   DW_AT_type        : <0xac9>	
    <bf9>   DW_AT_low_pc      : 0x8694	
    <bfd>   DW_AT_high_pc     : 0x18	
    <c01>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c03>   DW_AT_GNU_all_call_sites: 1	
    <c03>   DW_AT_sibling     : <0xc33>	
 <2><c07>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <c08>   DW_AT_name        : (indirect string, offset: 0x429): dest	
    <c0c>   DW_AT_decl_file   : 1	
    <c0d>   DW_AT_decl_line   : 94	
    <c0e>   DW_AT_type        : <0xac9>	
    <c12>   DW_AT_location    : 0x8ad	(location list)
 <2><c16>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <c17>   DW_AT_name        : src	
    <c1b>   DW_AT_decl_file   : 1	
    <c1c>   DW_AT_decl_line   : 94	
    <c1d>   DW_AT_type        : <0xbe3>	
    <c21>   DW_AT_location    : 0x8d8	(location list)
 <2><c25>: Abbrev Number: 22 (DW_TAG_variable)
    <c26>   DW_AT_name        : (indirect string, offset: 0x424): save	
    <c2a>   DW_AT_decl_file   : 1	
    <c2b>   DW_AT_decl_line   : 96	
    <c2c>   DW_AT_type        : <0xc33>	
    <c30>   DW_AT_location    : 1 byte block: 50 	(DW_OP_reg0 (r0))
 <2><c32>: Abbrev Number: 0
 <1><c33>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <c34>   DW_AT_byte_size   : 4	
    <c35>   DW_AT_type        : <0xc39>	
 <1><c39>: Abbrev Number: 3 (DW_TAG_base_type)
    <c3a>   DW_AT_byte_size   : 1	
    <c3b>   DW_AT_encoding    : 8	(unsigned char)
    <c3c>   DW_AT_name        : (indirect string, offset: 0x5c): char	
 <1><c40>: Abbrev Number: 20 (DW_TAG_subprogram)
    <c41>   DW_AT_external    : 1	
    <c41>   DW_AT_name        : (indirect string, offset: 0x41c): strncpy	
    <c45>   DW_AT_decl_file   : 1	
    <c46>   DW_AT_decl_line   : 101	
    <c47>   DW_AT_prototyped  : 1	
    <c47>   DW_AT_type        : <0xac9>	
    <c4b>   DW_AT_low_pc      : 0x86ac	
    <c4f>   DW_AT_high_pc     : 0x40	
    <c53>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c55>   DW_AT_GNU_all_call_sites: 1	
    <c55>   DW_AT_sibling     : <0xca1>	
 <2><c59>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <c5a>   DW_AT_name        : (indirect string, offset: 0x429): dest	
    <c5e>   DW_AT_decl_file   : 1	
    <c5f>   DW_AT_decl_line   : 101	
    <c60>   DW_AT_type        : <0xac9>	
    <c64>   DW_AT_location    : 0x903	(location list)
 <2><c68>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <c69>   DW_AT_name        : src	
    <c6d>   DW_AT_decl_file   : 1	
    <c6e>   DW_AT_decl_line   : 101	
    <c6f>   DW_AT_type        : <0xbe3>	
    <c73>   DW_AT_location    : 0x923	(location list)
 <2><c77>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <c78>   DW_AT_name        : (indirect string, offset: 0x433): numChars	
    <c7c>   DW_AT_decl_file   : 1	
    <c7d>   DW_AT_decl_line   : 101	
    <c7e>   DW_AT_type        : <0xca1>	
    <c82>   DW_AT_location    : 0x95d	(location list)
 <2><c86>: Abbrev Number: 22 (DW_TAG_variable)
    <c87>   DW_AT_name        : (indirect string, offset: 0x424): save	
    <c8b>   DW_AT_decl_file   : 1	
    <c8c>   DW_AT_decl_line   : 103	
    <c8d>   DW_AT_type        : <0xac9>	
    <c91>   DW_AT_location    : 1 byte block: 50 	(DW_OP_reg0 (r0))
 <2><c93>: Abbrev Number: 13 (DW_TAG_variable)
    <c94>   DW_AT_name        : i	
    <c96>   DW_AT_decl_file   : 1	
    <c97>   DW_AT_decl_line   : 104	
    <c98>   DW_AT_type        : <0xa97>	
    <c9c>   DW_AT_location    : 0x97e	(location list)
 <2><ca0>: Abbrev Number: 0
 <1><ca1>: Abbrev Number: 21 (DW_TAG_const_type)
    <ca2>   DW_AT_type        : <0xa97>	
 <1><ca6>: Abbrev Number: 0
  Compilation Unit @ offset 0xca7:
   Length:        0xa62 (32-bit)
   Version:       4
   Abbrev Offset: 0x585
   Pointer Size:  4
 <0><cb2>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <cb3>   DW_AT_producer    : (indirect string, offset: 0x7f): GNU C 4.8.2 -mfpu=vfp -mfloat-abi=hard -march=armv6zk -mtune=arm1176jzf-s -g -O2	
    <cb7>   DW_AT_language    : 1	(ANSI C)
    <cb8>   DW_AT_name        : (indirect string, offset: 0x4c7): source/screenbackground.c	
    <cbc>   DW_AT_comp_dir    : (indirect string, offset: 0x132): /home/robert/Desktop/rasp/chapuzas/template2	
    <cc0>   DW_AT_low_pc      : 0x86ec	
    <cc4>   DW_AT_high_pc     : 0x920	
    <cc8>   DW_AT_stmt_list   : 0x5ce	
 <1><ccc>: Abbrev Number: 2 (DW_TAG_typedef)
    <ccd>   DW_AT_name        : (indirect string, offset: 0x30b): __int8_t	
    <cd1>   DW_AT_decl_file   : 2	
    <cd2>   DW_AT_decl_line   : 27	
    <cd3>   DW_AT_type        : <0xcd7>	
 <1><cd7>: Abbrev Number: 3 (DW_TAG_base_type)
    <cd8>   DW_AT_byte_size   : 1	
    <cd9>   DW_AT_encoding    : 6	(signed char)
    <cda>   DW_AT_name        : (indirect string, offset: 0x55): signed char	
 <1><cde>: Abbrev Number: 2 (DW_TAG_typedef)
    <cdf>   DW_AT_name        : (indirect string, offset: 0x2c1): __uint8_t	
    <ce3>   DW_AT_decl_file   : 2	
    <ce4>   DW_AT_decl_line   : 28	
    <ce5>   DW_AT_type        : <0xce9>	
 <1><ce9>: Abbrev Number: 3 (DW_TAG_base_type)
    <cea>   DW_AT_byte_size   : 1	
    <ceb>   DW_AT_encoding    : 8	(unsigned char)
    <cec>   DW_AT_name        : (indirect string, offset: 0x53): unsigned char	
 <1><cf0>: Abbrev Number: 3 (DW_TAG_base_type)
    <cf1>   DW_AT_byte_size   : 2	
    <cf2>   DW_AT_encoding    : 5	(signed)
    <cf3>   DW_AT_name        : (indirect string, offset: 0x121): short int	
 <1><cf7>: Abbrev Number: 2 (DW_TAG_typedef)
    <cf8>   DW_AT_name        : (indirect string, offset: 0x25f): __uint16_t	
    <cfc>   DW_AT_decl_file   : 2	
    <cfd>   DW_AT_decl_line   : 38	
    <cfe>   DW_AT_type        : <0xd02>	
 <1><d02>: Abbrev Number: 3 (DW_TAG_base_type)
    <d03>   DW_AT_byte_size   : 2	
    <d04>   DW_AT_encoding    : 7	(unsigned)
    <d05>   DW_AT_name        : (indirect string, offset: 0xdb): short unsigned int	
 <1><d09>: Abbrev Number: 2 (DW_TAG_typedef)
    <d0a>   DW_AT_name        : (indirect string, offset: 0x357): __int32_t	
    <d0e>   DW_AT_decl_file   : 2	
    <d0f>   DW_AT_decl_line   : 55	
    <d10>   DW_AT_type        : <0xd14>	
 <1><d14>: Abbrev Number: 3 (DW_TAG_base_type)
    <d15>   DW_AT_byte_size   : 4	
    <d16>   DW_AT_encoding    : 5	(signed)
    <d17>   DW_AT_name        : (indirect string, offset: 0x5): long int	
 <1><d1b>: Abbrev Number: 2 (DW_TAG_typedef)
    <d1c>   DW_AT_name        : (indirect string, offset: 0xd0): __uint32_t	
    <d20>   DW_AT_decl_file   : 2	
    <d21>   DW_AT_decl_line   : 56	
    <d22>   DW_AT_type        : <0xd26>	
 <1><d26>: Abbrev Number: 3 (DW_TAG_base_type)
    <d27>   DW_AT_byte_size   : 4	
    <d28>   DW_AT_encoding    : 7	(unsigned)
    <d29>   DW_AT_name        : (indirect string, offset: 0x37): long unsigned int	
 <1><d2d>: Abbrev Number: 3 (DW_TAG_base_type)
    <d2e>   DW_AT_byte_size   : 8	
    <d2f>   DW_AT_encoding    : 5	(signed)
    <d30>   DW_AT_name        : (indirect string, offset: 0x0): long long int	
 <1><d34>: Abbrev Number: 3 (DW_TAG_base_type)
    <d35>   DW_AT_byte_size   : 8	
    <d36>   DW_AT_encoding    : 7	(unsigned)
    <d37>   DW_AT_name        : (indirect string, offset: 0x32): long long unsigned int	
 <1><d3b>: Abbrev Number: 4 (DW_TAG_base_type)
    <d3c>   DW_AT_byte_size   : 4	
    <d3d>   DW_AT_encoding    : 5	(signed)
    <d3e>   DW_AT_name        : int	
 <1><d42>: Abbrev Number: 3 (DW_TAG_base_type)
    <d43>   DW_AT_byte_size   : 4	
    <d44>   DW_AT_encoding    : 7	(unsigned)
    <d45>   DW_AT_name        : (indirect string, offset: 0x3c): unsigned int	
 <1><d49>: Abbrev Number: 2 (DW_TAG_typedef)
    <d4a>   DW_AT_name        : (indirect string, offset: 0x30d): int8_t	
    <d4e>   DW_AT_decl_file   : 3	
    <d4f>   DW_AT_decl_line   : 41	
    <d50>   DW_AT_type        : <0xccc>	
 <1><d54>: Abbrev Number: 2 (DW_TAG_typedef)
    <d55>   DW_AT_name        : (indirect string, offset: 0x2c3): uint8_t	
    <d59>   DW_AT_decl_file   : 3	
    <d5a>   DW_AT_decl_line   : 42	
    <d5b>   DW_AT_type        : <0xcde>	
 <1><d5f>: Abbrev Number: 2 (DW_TAG_typedef)
    <d60>   DW_AT_name        : (indirect string, offset: 0x261): uint16_t	
    <d64>   DW_AT_decl_file   : 3	
    <d65>   DW_AT_decl_line   : 54	
    <d66>   DW_AT_type        : <0xcf7>	
 <1><d6a>: Abbrev Number: 2 (DW_TAG_typedef)
    <d6b>   DW_AT_name        : (indirect string, offset: 0x359): int32_t	
    <d6f>   DW_AT_decl_file   : 3	
    <d70>   DW_AT_decl_line   : 65	
    <d71>   DW_AT_type        : <0xd09>	
 <1><d75>: Abbrev Number: 2 (DW_TAG_typedef)
    <d76>   DW_AT_name        : (indirect string, offset: 0xd2): uint32_t	
    <d7a>   DW_AT_decl_file   : 3	
    <d7b>   DW_AT_decl_line   : 66	
    <d7c>   DW_AT_type        : <0xd1b>	
 <1><d80>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <d81>   DW_AT_type        : <0xd75>	
 <1><d85>: Abbrev Number: 6 (DW_TAG_structure_type)
    <d86>   DW_AT_name        : (indirect string, offset: 0x556): atag_header	
    <d8a>   DW_AT_byte_size   : 8	
    <d8b>   DW_AT_decl_file   : 4	
    <d8c>   DW_AT_decl_line   : 29	
    <d8d>   DW_AT_sibling     : <0xdaa>	
 <2><d91>: Abbrev Number: 7 (DW_TAG_member)
    <d92>   DW_AT_name        : (indirect string, offset: 0x33a): size	
    <d96>   DW_AT_decl_file   : 4	
    <d97>   DW_AT_decl_line   : 31	
    <d98>   DW_AT_type        : <0xd75>	
    <d9c>   DW_AT_data_member_location: 0	
 <2><d9d>: Abbrev Number: 8 (DW_TAG_member)
    <d9e>   DW_AT_name        : tag	
    <da2>   DW_AT_decl_file   : 4	
    <da3>   DW_AT_decl_line   : 32	
    <da4>   DW_AT_type        : <0xd75>	
    <da8>   DW_AT_data_member_location: 4	
 <2><da9>: Abbrev Number: 0
 <1><daa>: Abbrev Number: 6 (DW_TAG_structure_type)
    <dab>   DW_AT_name        : (indirect string, offset: 0x4ba): atag_cmdline	
    <daf>   DW_AT_byte_size   : 12	
    <db0>   DW_AT_decl_file   : 4	
    <db1>   DW_AT_decl_line   : 115	
    <db2>   DW_AT_sibling     : <0xdcf>	
 <2><db6>: Abbrev Number: 7 (DW_TAG_member)
    <db7>   DW_AT_name        : (indirect string, offset: 0x55b): header	
    <dbb>   DW_AT_decl_file   : 4	
    <dbc>   DW_AT_decl_line   : 117	
    <dbd>   DW_AT_type        : <0xd85>	
    <dc1>   DW_AT_data_member_location: 0	
 <2><dc2>: Abbrev Number: 7 (DW_TAG_member)
    <dc3>   DW_AT_name        : (indirect string, offset: 0x4bf): cmdline	
    <dc7>   DW_AT_decl_file   : 4	
    <dc8>   DW_AT_decl_line   : 118	
    <dc9>   DW_AT_type        : <0xdcf>	
    <dcd>   DW_AT_data_member_location: 8	
 <2><dce>: Abbrev Number: 0
 <1><dcf>: Abbrev Number: 3 (DW_TAG_base_type)
    <dd0>   DW_AT_byte_size   : 1	
    <dd1>   DW_AT_encoding    : 8	(unsigned char)
    <dd2>   DW_AT_name        : (indirect string, offset: 0x5c): char	
 <1><dd6>: Abbrev Number: 9 (DW_TAG_structure_type)
    <dd7>   DW_AT_byte_size   : 40	
    <dd8>   DW_AT_decl_file   : 5	
    <dd9>   DW_AT_decl_line   : 34	
    <dda>   DW_AT_sibling     : <0xe53>	
 <2><dde>: Abbrev Number: 7 (DW_TAG_member)
    <ddf>   DW_AT_name        : (indirect string, offset: 0x231): pWidth	
    <de3>   DW_AT_decl_file   : 5	
    <de4>   DW_AT_decl_line   : 36	
    <de5>   DW_AT_type        : <0xd80>	
    <de9>   DW_AT_data_member_location: 0	
 <2><dea>: Abbrev Number: 7 (DW_TAG_member)
    <deb>   DW_AT_name        : (indirect string, offset: 0x31a): pHeight	
    <def>   DW_AT_decl_file   : 5	
    <df0>   DW_AT_decl_line   : 37	
    <df1>   DW_AT_type        : <0xd80>	
    <df5>   DW_AT_data_member_location: 4	
 <2><df6>: Abbrev Number: 7 (DW_TAG_member)
    <df7>   DW_AT_name        : (indirect string, offset: 0x22a): vWidth	
    <dfb>   DW_AT_decl_file   : 5	
    <dfc>   DW_AT_decl_line   : 38	
    <dfd>   DW_AT_type        : <0xd80>	
    <e01>   DW_AT_data_member_location: 8	
 <2><e02>: Abbrev Number: 7 (DW_TAG_member)
    <e03>   DW_AT_name        : (indirect string, offset: 0x2f3): vHeight	
    <e07>   DW_AT_decl_file   : 5	
    <e08>   DW_AT_decl_line   : 39	
    <e09>   DW_AT_type        : <0xd80>	
    <e0d>   DW_AT_data_member_location: 12	
 <2><e0e>: Abbrev Number: 7 (DW_TAG_member)
    <e0f>   DW_AT_name        : (indirect string, offset: 0x3bf): pitch	
    <e13>   DW_AT_decl_file   : 5	
    <e14>   DW_AT_decl_line   : 40	
    <e15>   DW_AT_type        : <0xd80>	
    <e19>   DW_AT_data_member_location: 16	
 <2><e1a>: Abbrev Number: 7 (DW_TAG_member)
    <e1b>   DW_AT_name        : (indirect string, offset: 0x3d3): cMode	
    <e1f>   DW_AT_decl_file   : 5	
    <e20>   DW_AT_decl_line   : 41	
    <e21>   DW_AT_type        : <0xd80>	
    <e25>   DW_AT_data_member_location: 20	
 <2><e26>: Abbrev Number: 8 (DW_TAG_member)
    <e27>   DW_AT_name        : x	
    <e29>   DW_AT_decl_file   : 5	
    <e2a>   DW_AT_decl_line   : 42	
    <e2b>   DW_AT_type        : <0xd80>	
    <e2f>   DW_AT_data_member_location: 24	
 <2><e30>: Abbrev Number: 8 (DW_TAG_member)
    <e31>   DW_AT_name        : y	
    <e33>   DW_AT_decl_file   : 5	
    <e34>   DW_AT_decl_line   : 43	
    <e35>   DW_AT_type        : <0xd80>	
    <e39>   DW_AT_data_member_location: 28	
 <2><e3a>: Abbrev Number: 7 (DW_TAG_member)
    <e3b>   DW_AT_name        : (indirect string, offset: 0x361): pointer	
    <e3f>   DW_AT_decl_file   : 5	
    <e40>   DW_AT_decl_line   : 44	
    <e41>   DW_AT_type        : <0xd80>	
    <e45>   DW_AT_data_member_location: 32	
 <2><e46>: Abbrev Number: 7 (DW_TAG_member)
    <e47>   DW_AT_name        : (indirect string, offset: 0x33a): size	
    <e4b>   DW_AT_decl_file   : 5	
    <e4c>   DW_AT_decl_line   : 45	
    <e4d>   DW_AT_type        : <0xd80>	
    <e51>   DW_AT_data_member_location: 36	
 <2><e52>: Abbrev Number: 0
 <1><e53>: Abbrev Number: 2 (DW_TAG_typedef)
    <e54>   DW_AT_name        : (indirect string, offset: 0x39e): rpi_gpu_framebuffer_descriptor_t	
    <e58>   DW_AT_decl_file   : 5	
    <e59>   DW_AT_decl_line   : 48	
    <e5a>   DW_AT_type        : <0xdd6>	
 <1><e5e>: Abbrev Number: 10 (DW_TAG_structure_type)
    <e5f>   DW_AT_byte_size   : 256	
    <e61>   DW_AT_decl_file   : 6	
    <e62>   DW_AT_decl_line   : 17	
    <e63>   DW_AT_sibling     : <0xef8>	
 <2><e67>: Abbrev Number: 7 (DW_TAG_member)
    <e68>   DW_AT_name        : (indirect string, offset: 0x487): currentX	
    <e6c>   DW_AT_decl_file   : 6	
    <e6d>   DW_AT_decl_line   : 18	
    <e6e>   DW_AT_type        : <0xd75>	
    <e72>   DW_AT_data_member_location: 0	
 <2><e73>: Abbrev Number: 7 (DW_TAG_member)
    <e74>   DW_AT_name        : (indirect string, offset: 0x490): currentY	
    <e78>   DW_AT_decl_file   : 6	
    <e79>   DW_AT_decl_line   : 19	
    <e7a>   DW_AT_type        : <0xd75>	
    <e7e>   DW_AT_data_member_location: 4	
 <2><e7f>: Abbrev Number: 7 (DW_TAG_member)
    <e80>   DW_AT_name        : (indirect string, offset: 0x515): onTime	
    <e84>   DW_AT_decl_file   : 6	
    <e85>   DW_AT_decl_line   : 20	
    <e86>   DW_AT_type        : <0xef8>	
    <e8a>   DW_AT_data_member_location: 8	
 <2><e8b>: Abbrev Number: 7 (DW_TAG_member)
    <e8c>   DW_AT_name        : (indirect string, offset: 0x51c): board	
    <e90>   DW_AT_decl_file   : 6	
    <e91>   DW_AT_decl_line   : 21	
    <e92>   DW_AT_type        : <0xefe>	
    <e96>   DW_AT_data_member_location: 12	
 <2><e97>: Abbrev Number: 8 (DW_TAG_member)
    <e98>   DW_AT_name        : rev	
    <e9c>   DW_AT_decl_file   : 6	
    <e9d>   DW_AT_decl_line   : 22	
    <e9e>   DW_AT_type        : <0xefe>	
    <ea2>   DW_AT_data_member_location: 52	
 <2><ea3>: Abbrev Number: 7 (DW_TAG_member)
    <ea4>   DW_AT_name        : (indirect string, offset: 0x4fe): serial	
    <ea8>   DW_AT_decl_file   : 6	
    <ea9>   DW_AT_decl_line   : 23	
    <eaa>   DW_AT_type        : <0xefe>	
    <eae>   DW_AT_data_member_location: 92	
 <2><eaf>: Abbrev Number: 8 (DW_TAG_member)
    <eb0>   DW_AT_name        : mac	
    <eb4>   DW_AT_decl_file   : 6	
    <eb5>   DW_AT_decl_line   : 24	
    <eb6>   DW_AT_type        : <0xefe>	
    <eba>   DW_AT_data_member_location: 132	
 <2><ebb>: Abbrev Number: 7 (DW_TAG_member)
    <ebc>   DW_AT_name        : (indirect string, offset: 0x4b2): freqCPU	
    <ec0>   DW_AT_decl_file   : 6	
    <ec1>   DW_AT_decl_line   : 25	
    <ec2>   DW_AT_type        : <0xefe>	
    <ec6>   DW_AT_data_member_location: 172	
 <2><ec7>: Abbrev Number: 7 (DW_TAG_member)
    <ec8>   DW_AT_name        : (indirect string, offset: 0x4f3): resolution	
    <ecc>   DW_AT_decl_file   : 6	
    <ecd>   DW_AT_decl_line   : 26	
    <ece>   DW_AT_type        : <0xefe>	
    <ed2>   DW_AT_data_member_location: 212	
 <2><ed3>: Abbrev Number: 7 (DW_TAG_member)
    <ed4>   DW_AT_name        : (indirect string, offset: 0x4e1): bgColor	
    <ed8>   DW_AT_decl_file   : 6	
    <ed9>   DW_AT_decl_line   : 27	
    <eda>   DW_AT_type        : <0xd5f>	
    <ede>   DW_AT_data_member_location: 252	
 <2><edf>: Abbrev Number: 7 (DW_TAG_member)
    <ee0>   DW_AT_name        : (indirect string, offset: 0x531): workingChar	
    <ee4>   DW_AT_decl_file   : 6	
    <ee5>   DW_AT_decl_line   : 28	
    <ee6>   DW_AT_type        : <0xd54>	
    <eea>   DW_AT_data_member_location: 254	
 <2><eeb>: Abbrev Number: 8 (DW_TAG_member)
    <eec>   DW_AT_name        : bwk	
    <ef0>   DW_AT_decl_file   : 6	
    <ef1>   DW_AT_decl_line   : 29	
    <ef2>   DW_AT_type        : <0xd54>	
    <ef6>   DW_AT_data_member_location: 255	
 <2><ef7>: Abbrev Number: 0
 <1><ef8>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <ef9>   DW_AT_byte_size   : 4	
    <efa>   DW_AT_type        : <0xd75>	
 <1><efe>: Abbrev Number: 12 (DW_TAG_array_type)
    <eff>   DW_AT_type        : <0xd54>	
    <f03>   DW_AT_sibling     : <0xf0e>	
 <2><f07>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <f08>   DW_AT_type        : <0xf0e>	
    <f0c>   DW_AT_upper_bound : 39	
 <2><f0d>: Abbrev Number: 0
 <1><f0e>: Abbrev Number: 3 (DW_TAG_base_type)
    <f0f>   DW_AT_byte_size   : 4	
    <f10>   DW_AT_encoding    : 7	(unsigned)
    <f11>   DW_AT_name        : (indirect string, offset: 0x47e): sizetype	
 <1><f15>: Abbrev Number: 2 (DW_TAG_typedef)
    <f16>   DW_AT_name        : (indirect string, offset: 0x50c): bgInfo_t	
    <f1a>   DW_AT_decl_file   : 6	
    <f1b>   DW_AT_decl_line   : 31	
    <f1c>   DW_AT_type        : <0xe5e>	
 <1><f20>: Abbrev Number: 14 (DW_TAG_subprogram)
    <f21>   DW_AT_external    : 1	
    <f21>   DW_AT_name        : (indirect string, offset: 0xee): bgRefresh	
    <f25>   DW_AT_decl_file   : 1	
    <f26>   DW_AT_decl_line   : 61	
    <f27>   DW_AT_prototyped  : 1	
    <f27>   DW_AT_low_pc      : 0x86ec	
    <f2b>   DW_AT_high_pc     : 0x9c	
    <f2f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f31>   DW_AT_GNU_all_call_sites: 1	
    <f31>   DW_AT_sibling     : <0xf6e>	
 <2><f35>: Abbrev Number: 15 (DW_TAG_GNU_call_site)
    <f36>   DW_AT_low_pc      : 0x874c	
    <f3a>   DW_AT_abstract_origin: <0x1690>	
    <f3e>   DW_AT_sibling     : <0xf56>	
 <3><f42>: Abbrev Number: 16 (DW_TAG_GNU_call_site_parameter)
    <f43>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (r2))
    <f45>   DW_AT_GNU_call_site_value: 2 byte block: 8 38 	(DW_OP_const1u: 56)
 <3><f48>: Abbrev Number: 16 (DW_TAG_GNU_call_site_parameter)
    <f49>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (r1))
    <f4b>   DW_AT_GNU_call_site_value: 3 byte block: a 38 4 	(DW_OP_const2u: 1080)
 <3><f4f>: Abbrev Number: 16 (DW_TAG_GNU_call_site_parameter)
    <f50>   DW_AT_location    : 1 byte block: 50 	(DW_OP_reg0 (r0))
    <f52>   DW_AT_GNU_call_site_value: 2 byte block: 8 20 	(DW_OP_const1u: 32)
 <3><f55>: Abbrev Number: 0
 <2><f56>: Abbrev Number: 17 (DW_TAG_GNU_call_site)
    <f57>   DW_AT_low_pc      : 0x8760	
    <f5b>   DW_AT_GNU_tail_call: 1	
    <f5b>   DW_AT_abstract_origin: <0x1690>	
 <3><f5f>: Abbrev Number: 16 (DW_TAG_GNU_call_site_parameter)
    <f60>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (r2))
    <f62>   DW_AT_GNU_call_site_value: 2 byte block: 8 38 	(DW_OP_const1u: 56)
 <3><f65>: Abbrev Number: 16 (DW_TAG_GNU_call_site_parameter)
    <f66>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (r1))
    <f68>   DW_AT_GNU_call_site_value: 3 byte block: a 38 4 	(DW_OP_const2u: 1080)
 <3><f6c>: Abbrev Number: 0
 <2><f6d>: Abbrev Number: 0
 <1><f6e>: Abbrev Number: 14 (DW_TAG_subprogram)
    <f6f>   DW_AT_external    : 1	
    <f6f>   DW_AT_name        : (indirect string, offset: 0x472): bgDrawEdges	
    <f73>   DW_AT_decl_file   : 1	
    <f74>   DW_AT_decl_line   : 97	
    <f75>   DW_AT_prototyped  : 1	
    <f75>   DW_AT_low_pc      : 0x8788	
    <f79>   DW_AT_high_pc     : 0x2b4	
    <f7d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f7f>   DW_AT_GNU_all_call_sites: 1	
    <f7f>   DW_AT_sibling     : <0x10e9>	
 <2><f83>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <f84>   DW_AT_name        : (indirect string, offset: 0x46c): color	
    <f88>   DW_AT_decl_file   : 1	
    <f89>   DW_AT_decl_line   : 97	
    <f8a>   DW_AT_type        : <0xd5f>	
    <f8e>   DW_AT_location    : 0x9b8	(location list)
 <2><f92>: Abbrev Number: 19 (DW_TAG_variable)
    <f93>   DW_AT_name        : i	
    <f95>   DW_AT_decl_file   : 1	
    <f96>   DW_AT_decl_line   : 99	
    <f97>   DW_AT_type        : <0xd75>	
    <f9b>   DW_AT_location    : 0x9d9	(location list)
 <2><f9f>: Abbrev Number: 19 (DW_TAG_variable)
